/*Мишка Лимак хочет стать самым большим медведем, ну, или хотя бы стать больше своего старшего брата Боба.

Сейчас вес Лимака равен a, а вес Боба равен b. Гарантируется, что вес Лимака меньше или равен весу Боба.

Лимак ест много, и его вес утраивается каждый год, а вес Боба удваивается каждый год.

Через сколько целых лет Лимак станет строго больше (т. е. будет весить строго больше) Боба?*/
#include <iostream>
using namespace std;

int main(){
    int a, b;
    cin >> a >> b;
    int years = 0;
    while(a <= b){
        a *= 3;
        b *= 2;
        years++;
    }
    cout << years << endl;
    return 0;
}