/*Капитализация — это запись слова, в которой первая буква слова записывается как прописная буква. 
Ваша задача, вывести капитализацию заданного слова.

Обратите внимание, что в капитализации все буквы слова кроме первой остаются не измененными.

Входные данные
В первой строке записано непустое слово. Слово состоит из строчных и прописных букв латинского алфавита. 
Длина заданного слова не превосходит 103 букв.

Выходные данные
Выведите капитализацию слова.*/
    #include <iostream>
    #include <string>

    using namespace std;
    int main(){
        string c;
        cin >> c;
        if (islower(c[0])) {
            c[0] = toupper(c[0]);
        }
        cout << c << endl;
        return 0;
    }