/*Слоник решил сходить в гости к другу. Оказалось, что дом слоника находится в точке 0, 
а дом его друга в точке x(x > 0) координатной прямой. За один шаг слоник может переместиться на 1, 2, 3, 4
 или 5 позиций вперёд. Помогите ему определить, за какое минимальное количество шагов он может добраться до дома друга.

Входные данные
В первой строке входных данных записано одно целое число x (1 ≤ x ≤ 1 000 000) — координата дома друга слоника.

Выходные данные
Выведите минимальное количество шагов, которые необходимо сделать слонику, чтобы попасть из точки 0 в точку x.*/
#include <iostream>
using namespace std;
int main(){
    int n, counter=0;
    cin>>n;
    while(n!=0){
        if(n-5>=0){
            n-=5;
            counter++;
        }
        else if(n-4>=0){
            n-=4;
            counter++;
        }
        else if(n-3>=0){
            n-=3;
            counter++;
        }
        else if(n-2>=0){
            n-=2;
            counter++;
        }
        else if(n-1>=0){
            n-=1;
            counter++;
        }
    }
    cout<<counter;
}